{
    "dataset_params": {
        "class_name": "H5Reader",
        "config": {
            "filename": "/home/work/asln/hn_delin/KFoldSplit_5splits_LARC.h5",
            "batch_size": 16,
            "x_name": "input",
            "y_name": "target_an",
            "batch_cache": 10,
            "shuffle": true,
            "fold_prefix": "fold",
            "train_folds": [
              "2/352", "3/352", "4/352", "4/256", "5/352", "5/256"
            ],
            "val_folds": [
                "1/352", "1/256"
            ],
            "test_folds": [

            ],
            "preprocessors": [
                {
                    "class_name": "ImageNormalizerPreprocessor"
                }
            ]
        }
    },
    "train_params": {
        "epochs": 5,
        "callbacks": [
            {
                "class_name": "EarlyStopping",
                "config": {
                    "monitor": "val_loss",
                    "patience": 30
                }
            }
        ]
    },
    "input_params": {
        "shape": [
            null,
            null,
            1
        ]
    },
    "model_params": {
        "loss": {
            "class_name": "BinaryFbetaLoss"
        },
        "optimizer": {
            "class_name": "adam",
            "config": {
                "learning_rate": 0.0001
            }
        },
        "metrics": [
            {
                "class_name": "BinaryFbeta"
            },
            {
                "class_name": "Dice"
            }
        ]
    },
    "architecture": {"type": "Unet", "layers": [{"class_name": "Conv2D", "config": {"filters": 64, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "name": "conv1"}, {"class_name": "MaxPooling2D"}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "name": "conv2"}, {"class_name": "MaxPooling2D"}, {"class_name": "Conv2D", "config": {"filters": 256, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 256, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "name": "conv3"}, {"class_name": "MaxPooling2D"}, {"class_name": "Conv2D", "config": {"filters": 512, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 512, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "name": "conv4"}, {"class_name": "MaxPooling2D"}, {"class_name": "Conv2D", "config": {"filters": 1024, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 1024, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv4", "class_name": "Conv2DTranspose", "config": {"filters": 512, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 512, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "inputs": ["conv4", "upconv4"]}, {"class_name": "Conv2D", "config": {"filters": 512, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv3", "class_name": "Conv2DTranspose", "config": {"filters": 256, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 256, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "inputs": ["conv3", "upconv3"]}, {"class_name": "Conv2D", "config": {"filters": 256, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv2", "class_name": "Conv2DTranspose", "config": {"filters": 128, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "inputs": ["conv2", "upconv2"]}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"name": "upconv1", "class_name": "Conv2DTranspose", "config": {"filters": 64, "kernel_size": 3, "strides": 2, "kernel_initializer": "he_normal", "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}, "inputs": ["conv1", "upconv1"]}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_size": 3, "activation": "relu", "kernel_initializer": "he_normal", "padding": "same"}, "normalizer": {"class_name": "BatchNormalization"}}, {"class_name": "Conv2D", "config": {"filters": 1, "kernel_size": 3, "activation": "sigmoid", "kernel_initializer": "he_normal", "padding": "same"}}]}
}
